smurfix/micropython/ports/esp32/boards/ESP32_GENERIC_C6/mpconfigboard.h
// This configuration is for a generic ESP32C6 board with 4MiB (or more) of flash.

#define MICROPY_HW_BOARD_NAME               "ESP32C6 module"
#define MICROPY_HW_MCU_NAME                 "ESP32C6"

#define MICROPY_PY_MACHINE_I2S              (0)

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)

// turn off USB and JTAG. It's a generic board.
#define MICROPY_HW_ESP_USB_SERIAL_JTAG      (0)
